app/Controllers/Carrito_controller.php

    public function catalogo(){

     //$session=session();
    // $data['perfil_id'] = $session['perfil_id'];
    // $data['nombre']  =  $session['nombre'];
     //$dato = array ('titulo'=>'Todos los productos');

     $productoModel = new Producto_model();
     $data['producto'] = $productoModel->orderBy('id','DESC')->findAll();
---
SELECT *
FROM `productos`
ORDER BY `id` DESC

    public function carritoViews()
{
    $sesion = session();
    $cart = \Config\Services::Cart();
    $productoModel = new Producto_model();
    $data['producto'] = $productoModel->findAll();
---
SELECT *
FROM `productos`