app/Controllers/Carrito_controller.php

    public function carritoViews()
{
    $sesion = session();
    $cart = \Config\Services::Cart();
    $productoModel = new Producto_model();
    $data['producto'] = $productoModel->findAll();
---
SELECT *
FROM `productos`