app/Controllers/Consulta_controller.php

    public function guardar_consulta()
{

    if (session()->get('logged_in') != 'TRUE') :
        $registrado = 'NO';
    else :
            $registrado = 'SI';
    endif;

    $formModel = new Consultas_model();

    $formModel->save([
        'nya' => $this->request->getVar('nya'),
        'email' => $this->request->getVar('email'),
        'asunto' => $this->request->getVar('asunto'),
        'mensaje'  => $this->request->getVar('texto'),
        'registrado' => $registrado,
    ]);
---
INSERT INTO `consultas` (`nya`, `email`, `asunto`, `mensaje`, `registrado`) VALUES ('Alfonso', 'marcosAlfonso@gmail.com', '', '', 'SI')